app/Controllers/backendPages/auth.php

    public function login()
    {
        $data = [];

        // Nếu form được submit
        if ($this->request->getMethod() === 'post') {
            // Kiểm tra dữ liệu từ form
            $validationRules = [
                'email'    => 'required|valid_email',
                'password' => 'required|min_length[6]',
            ];

            // Kiểm tra dữ liệu hợp lệ
            if ($this->validate($validationRules)) {
                // Dữ liệu hợp lệ, xử lý đăng nhập ở đây
                // Lấy dữ liệu từ form
                $email = $this->request->getPost('email');
                $password = $this->request->getPost('password');

                // Thực hiện logic đăng nhập, ví dụ:
                $model = new UserModel();
                $user = $model->where('email', $email)->first();

                if ($user && password_verify($password, $user['password'])) {
                    // Đăng nhập thành công, lấy thông tin người dùng từ cơ sở dữ liệu
                    $userData = $model->find($user['id']);
---
SELECT *
FROM `users`
WHERE `email` = 'admin@mail.com'
 LIMIT 1
SELECT *
FROM `users`
WHERE `users`.`id` = '1'